import pandas as pd
import numpy as np

#-------------------------------------총 데이터 추출 횟수 설정----------------------------------------
np.random.seed(42)
runs = 50
seconds_per_run = 100 
total_rows = runs * seconds_per_run 
#----------------------------------------------------------------------------------------------------


#-----------------------------------Time stamp 인덱싱------------------------------------------------
time_indices = pd.date_range(start="2026-08-01 10:30:00", periods=total_rows, freq="s") 
# 버전 문제 (s 소문자, 초단위 증가)
#----------------------------------------------------------------------------------------------------


#-----------------------------------압력 데이터 생성--------------------------------------------------
base_pressure = 150.0
noise = np.random.normal(loc=0, scale=3, size=total_rows) # 고주파 노이즈
drift = np.linspace(0, 10, total_rows) # 점진적 배기 밸브 오염에 의한 Drift 성분
pressure_values = base_pressure + noise + drift
#----------------------------------------------------------------------------------------------------


#------------------------------------결측치 생성------------------------------------------------------
pressure_values[1500:1600] = np.nan

df_trace = pd.DataFrame({
    "Timestamp": time_indices,
    "Run_ID": np.repeat(np.arange(1, runs + 1), seconds_per_run),
    "Step_No": [1, 2, 3, 4, 5] * (total_rows // 5),
    "Pressure": pressure_values
})
#----------------------------------------------------------------------------------------------------


#---------------------------Step No : 3  - 식각 공정의 압력 확인--------------------------------------
df_active = df_trace[df_trace["Step_No"] == 3].copy()
#----------------------------------------------------------------------------------------------------


#----------------------------결측치 처리 (선형보간 or Forward Fill)------------------------------------
df_active["Pressure_Cleaned"] = df_active["Pressure"].ffill()
#df_active["Pressure_Cleaned"] = df_active["Pressure"].interpolate(method="linear")
#----------------------------------------------------------------------------------------------------


#---------------------------------이동 평균 활용 Data Smoothing----------------------------------------
df_active["Pressure_Smoothed"] = df_active["Pressure_Cleaned"].rolling(window=20, min_periods=1).mean()
#----------------------------------------------------------------------------------------------------


#-----------------------------------결측치 보정 결과 확인----------------------------------------------
print("--- Check Missing Values Remained ---")
print(df_active[["Pressure", "Pressure_Cleaned"]].isna().sum())
#----------------------------------------------------------------------------------------------------


#-----------------------------------인터랙티브 그래프 플롯--------------------------------------------
import plotly.express as px
fig = px.line(df_active, x='Timestamp', y=['Pressure', 'Pressure_Smoothed'], title="Chamber Pressure Analysis")
fig.show()
#----------------------------------------------------------------------------------------------------
